# vstDrawCoordArcN

```pascal
PROCEDURE vstDrawCoordArcN(
				ptLeftTopX,ptLeftTopY : REAL;
				ptRghtBotX,ptRghtBotY : REAL;
				startAngle            : REAL;
				sweepAngle            : REAL);
```

```python
def vs.vstDrawCoordArcN(ptLeftTopX, ptLeftTopY, ptRghtBotX, ptRghtBotY, startAngle, sweepAngle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ptLeftTopX, ptLeftTopY|REAL|   |
|ptRghtBotX, ptRghtBotY|REAL|   |
|startAngle|REAL|   |
|sweepAngle|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Tool Events